In [ ]:
#*Task*: download a dataset form any platform
#1. Data cleaning and manupilaiton [Pandas]
#2. Remove duplicate rows ~ drop.duplicate
#3. Fill missing values with mean of respective values ~ 
#4. Normalise all numeric column in range of 0 nd 1

In [29]:
import pandas as pd

In [91]:
data = {"Column 1": [1,2,2,2,None,5], "Column 2": [None,2,2,3,4,5],"Column 3": [1,1,1,1,1,None]}

In [111]:
df = pd.DataFrame(data)
print(df)

   Column 1  Column 2  Column 3
0       1.0       NaN       1.0
1       2.0       2.0       1.0
2       2.0       2.0       1.0
3       2.0       3.0       1.0
4       NaN       4.0       1.0
5       5.0       5.0       NaN

In [113]:
df.drop_duplicates(inplace=True)

In [115]:
df

   Column 1  Column 2  Column 3
0       1.0       NaN       1.0
1       2.0       2.0       1.0
3       2.0       3.0       1.0
4       NaN       4.0       1.0
5       5.0       5.0       NaN

In [117]:
df.fillna(df.mean(numeric_only=True), inplace=True)

In [119]:
df

   Column 1  Column 2  Column 3
0       1.0       3.5       1.0
1       2.0       2.0       1.0
3       2.0       3.0       1.0
4       2.5       4.0       1.0
5       5.0       5.0       1.0

In [129]:
(df-df.min())/(df.max()-df.min())

   Column 1  Column 2  Column 3
0     0.000  0.500000       NaN
1     0.250  0.000000       NaN
3     0.250  0.333333       NaN
4     0.375  0.666667       NaN
5     1.000  1.000000       NaN